In [5]:
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="/Users/plopezbar/Desktop/ironhack_service_account_big_query.json"

In [6]:
import six
six.moves.reload_module(six)

In [7]:
from google.cloud import bigquery

In [8]:
client = bigquery.Client()

# Challenge 1

In [9]:
sql= '''
SELECT 
    PA.au_id ,
    PA.au_fname,
    PA.au_lname,
    PTA.title_id,
    PP.pub_name,
FROM 
     `ironhack-data-analytics-265219.publications.authors` PA
INNER JOIN 
    `ironhack-data-analytics-265219.publications.titleauthor` PTA
ON 
    PA.au_id = PTA.au_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.titles` PT
ON
    PTA.title_id = PT.title_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.publishers` PP
ON
    PT.pub_id = PP.pub_id
LIMIT 5
'''

In [10]:
query_job = client.query(query=sql)
df=query_job.to_dataframe()
df

         au_id  au_fname au_lname title_id              pub_name
0  899-46-2035      Anne   Ringer   PS2091        New Moon Books
1  846-92-7186    Sheryl   Hunter   PC8888  Algodata Infosystems
2  213-46-8915  Marjorie    Green   BU1032  Algodata Infosystems
3  267-41-2394   Michael  O'Leary   BU1111  Algodata Infosystems
4  267-41-2394   Michael  O'Leary   TC7777      Binnet & Hardley

# Challenge 2:

In [11]:
sql2= '''
SELECT 
    PA.au_id,
    PA.au_lname,
    PA.au_fname,
    PP.pub_name,
    COUNT(PT.title_id)
    
FROM 
     `ironhack-data-analytics-265219.publications.authors` PA
INNER JOIN 
    `ironhack-data-analytics-265219.publications.titleauthor` PTA
ON 
    PA.au_id = PTA.au_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.titles` PT
ON
    PTA.title_id = PT.title_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.publishers` PP
ON
    PT.pub_id = PP.pub_id
GROUP BY
    PA.au_id,
    PA.au_lname,
    PA.au_fname,
    PP.pub_name
LIMIT 5
'''

In [12]:
query_job = client.query(query=sql2)
df=query_job.to_dataframe()
df

         au_id au_lname  au_fname              pub_name  f0_
0  899-46-2035   Ringer      Anne        New Moon Books    1
1  846-92-7186   Hunter    Sheryl  Algodata Infosystems    1
2  213-46-8915    Green  Marjorie  Algodata Infosystems    1
3  267-41-2394  O'Leary   Michael  Algodata Infosystems    1
4  267-41-2394  O'Leary   Michael      Binnet & Hardley    1

#Â Challenge 3:

In [15]:
sql3= '''
SELECT 
    PA.au_id,
    PA.au_lname,
    PA.au_fname,
    SUM(PS.qty) AS total,
    
FROM 
     `ironhack-data-analytics-265219.publications.authors` PA
INNER JOIN 
    `ironhack-data-analytics-265219.publications.titleauthor` PTA
ON 
    PA.au_id = PTA.au_id
INNER JOIN
    `ironhack-data-analytics-265219.publications.sales` PS
ON
    PTA.title_id = PS.title_id
GROUP BY
    PA.au_id,
    PA.au_lname,
    PA.au_fname
ORDER BY
     total DESC
LIMIT 3
'''

In [16]:
query_job = client.query(query=sql3)
df=query_job.to_dataframe()
df

         au_id au_lname au_fname total
0  899-46-2035   Ringer     Anne   148
1  998-72-3567   Ringer   Albert   133
2  846-92-7186   Hunter   Sheryl    50

# Challenge 4:

In [25]:
sql4 = '''
SELECT 
    PA.au_id,
    PA.au_lname,
    PA.au_fname,
    SUM(PS.qty) AS total
FROM 
     `ironhack-data-analytics-265219.publications.authors` PA
LEFT JOIN 
    `ironhack-data-analytics-265219.publications.titleauthor` PTA
ON 
    PA.au_id = PTA.au_id
LEFT JOIN
    `ironhack-data-analytics-265219.publications.sales` PS
ON
    PTA.title_id = PS.title_id
GROUP BY
    PA.au_id,
    PA.au_lname,
    PA.au_fname
ORDER BY
     total DESC
'''

In [26]:
query_job = client.query(query=sql4)
df=query_job.to_dataframe()
df

          au_id        au_lname     au_fname total
0   899-46-2035          Ringer         Anne   148
1   998-72-3567          Ringer       Albert   133
2   846-92-7186          Hunter       Sheryl    50
3   427-17-2319            Dull          Ann    50
4   213-46-8915           Green     Marjorie    50
5   724-80-9391      MacFeather      Stearns    45
6   267-41-2394         O'Leary      Michael    45
7   807-91-6654        Panteley       Sylvia    40
8   722-51-5454        DeFrance       Michel    40
9   238-95-7766          Carson       Cheryl    30
10  486-29-1786        Locksley     Charlene    25
11  672-71-3249        Yokomoto        Akiko    20
12  756-30-7391          Karsen        Livia    20
13  472-27-2349      Gringlesby         Burt    20
14  648-92-1872  Blotchet-Halls     Reginald    20
15  172-32-1176           White      Johnson    15
16  274-80-9391        Straight         Dean    15
17  409-56-7008          Bennet      Abraham    15
18  712-45-1867    del Castillo        Innes    10
19  527-72-3246          Greene  Morningstar  None
20  341-22-1782           Smith      Meander  None
21  724-08-9931        Stringer         Dirk  None
22  893-72-1158        McBadden      Heather  None

# Bonus: